7767517
111 123
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 522 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=864
PReLU            PRelu_1                  1 1 522 338 0=32
ConvolutionDepthWise Conv_2                   1 1 338 525 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
PReLU            PRelu_3                  1 1 525 342 0=32
Convolution      Conv_4                   1 1 342 528 0=103 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3296
PReLU            PRelu_5                  1 1 528 346 0=103
ConvolutionDepthWise Conv_6                   1 1 346 531 0=103 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=927 7=103
PReLU            PRelu_7                  1 1 531 350 0=103
Convolution      Conv_8                   1 1 350 534 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6592
Split            splitncnn_0              1 2 534 534_splitncnn_0 534_splitncnn_1
Convolution      Conv_9                   1 1 534_splitncnn_1 537 0=13 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
PReLU            PRelu_10                 1 1 537 356 0=13
ConvolutionDepthWise Conv_11                  1 1 356 540 0=13 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=117 7=13
PReLU            PRelu_12                 1 1 540 360 0=13
Convolution      Conv_13                  1 1 360 543 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
BinaryOp         Add_14                   2 1 534_splitncnn_0 543 363 0=0
Split            splitncnn_1              1 2 363 363_splitncnn_0 363_splitncnn_1
Convolution      Conv_15                  1 1 363_splitncnn_1 546 0=13 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
PReLU            PRelu_16                 1 1 546 367 0=13
ConvolutionDepthWise Conv_17                  1 1 367 549 0=13 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=117 7=13
PReLU            PRelu_18                 1 1 549 371 0=13
Convolution      Conv_19                  1 1 371 552 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
BinaryOp         Add_20                   2 1 363_splitncnn_0 552 374 0=0
Split            splitncnn_2              1 2 374 374_splitncnn_0 374_splitncnn_1
Convolution      Conv_21                  1 1 374_splitncnn_1 555 0=13 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
PReLU            PRelu_22                 1 1 555 378 0=13
ConvolutionDepthWise Conv_23                  1 1 378 558 0=13 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=117 7=13
PReLU            PRelu_24                 1 1 558 382 0=13
Convolution      Conv_25                  1 1 382 561 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
BinaryOp         Add_26                   2 1 374_splitncnn_0 561 385 0=0
Split            splitncnn_3              1 2 385 385_splitncnn_0 385_splitncnn_1
Convolution      Conv_27                  1 1 385_splitncnn_1 564 0=13 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
PReLU            PRelu_28                 1 1 564 389 0=13
ConvolutionDepthWise Conv_29                  1 1 389 567 0=13 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=117 7=13
PReLU            PRelu_30                 1 1 567 393 0=13
Convolution      Conv_31                  1 1 393 570 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=832
BinaryOp         Add_32                   2 1 385_splitncnn_0 570 396 0=0
Convolution      Conv_33                  1 1 396 573 0=231 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=14784
PReLU            PRelu_34                 1 1 573 400 0=231
ConvolutionDepthWise Conv_35                  1 1 400 576 0=231 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2079 7=231
PReLU            PRelu_36                 1 1 576 404 0=231
Convolution      Conv_37                  1 1 404 579 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=29568
Split            splitncnn_4              1 2 579 579_splitncnn_0 579_splitncnn_1
Convolution      Conv_38                  1 1 579_splitncnn_1 582 0=231 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=29568
PReLU            PRelu_39                 1 1 582 410 0=231
ConvolutionDepthWise Conv_40                  1 1 410 585 0=231 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2079 7=231
PReLU            PRelu_41                 1 1 585 414 0=231
Convolution      Conv_42                  1 1 414 588 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=29568
BinaryOp         Add_43                   2 1 579_splitncnn_0 588 417 0=0
Split            splitncnn_5              1 2 417 417_splitncnn_0 417_splitncnn_1
Convolution      Conv_44                  1 1 417_splitncnn_1 591 0=52 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6656
PReLU            PRelu_45                 1 1 591 421 0=52
ConvolutionDepthWise Conv_46                  1 1 421 594 0=52 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=468 7=52
PReLU            PRelu_47                 1 1 594 425 0=52
Convolution      Conv_48                  1 1 425 597 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=6656
BinaryOp         Add_49                   2 1 417_splitncnn_0 597 428 0=0
Split            splitncnn_6              1 2 428 428_splitncnn_0 428_splitncnn_1
Convolution      Conv_50                  1 1 428_splitncnn_1 600 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_51                 1 1 600 432 0=26
ConvolutionDepthWise Conv_52                  1 1 432 603 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_53                 1 1 603 436 0=26
Convolution      Conv_54                  1 1 436 606 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_55                   2 1 428_splitncnn_0 606 439 0=0
Split            splitncnn_7              1 2 439 439_splitncnn_0 439_splitncnn_1
Convolution      Conv_56                  1 1 439_splitncnn_1 609 0=77 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9856
PReLU            PRelu_57                 1 1 609 443 0=77
ConvolutionDepthWise Conv_58                  1 1 443 612 0=77 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=693 7=77
PReLU            PRelu_59                 1 1 612 447 0=77
Convolution      Conv_60                  1 1 447 615 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=9856
BinaryOp         Add_61                   2 1 439_splitncnn_0 615 450 0=0
Split            splitncnn_8              1 2 450 450_splitncnn_0 450_splitncnn_1
Convolution      Conv_62                  1 1 450_splitncnn_1 618 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_63                 1 1 618 454 0=26
ConvolutionDepthWise Conv_64                  1 1 454 621 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_65                 1 1 621 458 0=26
Convolution      Conv_66                  1 1 458 624 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_67                   2 1 450_splitncnn_0 624 461 0=0
Split            splitncnn_9              1 2 461 461_splitncnn_0 461_splitncnn_1
Convolution      Conv_68                  1 1 461_splitncnn_1 627 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_69                 1 1 627 465 0=26
ConvolutionDepthWise Conv_70                  1 1 465 630 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_71                 1 1 630 469 0=26
Convolution      Conv_72                  1 1 469 633 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_73                   2 1 461_splitncnn_0 633 472 0=0
Convolution      Conv_74                  1 1 472 636 0=308 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=39424
PReLU            PRelu_75                 1 1 636 476 0=308
ConvolutionDepthWise Conv_76                  1 1 476 639 0=308 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=2772 7=308
PReLU            PRelu_77                 1 1 639 480 0=308
Convolution      Conv_78                  1 1 480 642 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=39424
Split            splitncnn_10             1 2 642 642_splitncnn_0 642_splitncnn_1
Convolution      Conv_79                  1 1 642_splitncnn_1 645 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_80                 1 1 645 486 0=26
ConvolutionDepthWise Conv_81                  1 1 486 648 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_82                 1 1 648 490 0=26
Convolution      Conv_83                  1 1 490 651 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_84                   2 1 642_splitncnn_0 651 493 0=0
Split            splitncnn_11             1 2 493 493_splitncnn_0 493_splitncnn_1
Convolution      Conv_85                  1 1 493_splitncnn_1 654 0=26 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
PReLU            PRelu_86                 1 1 654 497 0=26
ConvolutionDepthWise Conv_87                  1 1 497 657 0=26 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=234 7=26
PReLU            PRelu_88                 1 1 657 501 0=26
Convolution      Conv_89                  1 1 501 660 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=3328
BinaryOp         Add_90                   2 1 493_splitncnn_0 660 504 0=0
Convolution      Conv_91                  1 1 504 663 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
PReLU            PRelu_92                 1 1 663 508 0=512
ConvolutionDepthWise Conv_93                  1 1 508 666 0=512 1=5 11=5 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=12800 7=512
Reshape          Reshape_94               1 1 666 516 0=-1
InnerProduct     MatMul_95                1 1 516 518 0=128 1=0 2=65536
BatchNorm        BatchNormalization_96    1 1 518 519 0=128
InnerProduct     MatMul_97                1 1 519 output 0=3 1=0 2=384
